================================================================================
String fields
================================================================================

person: "Harry"
person: 'Ron'

--------------------------------------------------------------------------------

(source_file
  (scalar_field
    (field_name)
    (scalar_value
      (string)))
  (scalar_field
    (field_name)
    (scalar_value
      (string))))

================================================================================
List
================================================================================

dimension: [128, 160, 16, 16]

--------------------------------------------------------------------------------

(source_file
  (scalar_field
    (field_name)
    (scalar_list
      (scalar_value
        (dec_unsigned_integer))
      (scalar_value
        (dec_unsigned_integer))
      (scalar_value
        (dec_unsigned_integer))
      (scalar_value
        (dec_unsigned_integer)))))

================================================================================
Identifier
================================================================================

count: UNKNOWN

--------------------------------------------------------------------------------

(source_file
  (scalar_field
    (field_name)
    (scalar_value
      (identifier))))

================================================================================
Comma
================================================================================

foo: 10,bar: 20

--------------------------------------------------------------------------------

(source_file
  (scalar_field
    (field_name)
    (scalar_value
      (dec_unsigned_integer)))
  (scalar_field
    (field_name)
    (scalar_value
      (dec_unsigned_integer))))
